Revit 2024 API
RebarConstraint.GetDistanceToTargetHostFace Method
 Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double GetDistanceToTargetHostFace()
Visual Basic
Public Function GetDistanceToTargetHostFace As Double
Visual C++
public:
double GetDistanceToTargetHostFace()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace.'
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace